Revit 2024 API
BuiltInFailures.UniqueElementFailures.ProhibitUniqueElementDeletion Property
 Internal setting '%1!s!' is required by Revit and has been deleted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ProhibitUniqueElementDeletion { get; }
Visual Basic
Public Shared ReadOnly Property ProhibitUniqueElementDeletion As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ProhibitUniqueElementDeletion {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.UniqueElementFailures Class
Autodesk.Revit.DB Namespace